zephyrproject-rtos/hal_nxp/dts/nxp/lpc/LPC54607J512ET180-pinctrl.h
#define DMA0_TRIG9_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define FC1_CTS_SDA_SSEL0_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 1) /* PIO0_13 */
#define GPIO_PIO013_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT0_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT1_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT2_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT3_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT4_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT5_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT6_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define PINT_PINT7_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 0) /* PIO0_13 */
#define SCT0_IN0_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN1_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN2_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN3_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN4_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN5_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define SCT0_IN6_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 4) /* PIO0_13 */
#define UTICK0_CAPTURE0_PIO0_13 IOCON_MUX(13, IOCON_TYPE_D, 2) /* PIO0_13 */
#define ADC0_TRIG1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define ADC0_TRIG2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define CTIMER0_CAPTURE1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 3) /* PIO0_14 */
#define DMA0_TRIG0_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG10_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG11_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG12_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG13_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG14_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG15_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG16_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG17_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG18_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG19_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG20_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG21_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG22_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG23_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG24_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG25_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG26_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG27_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG28_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG29_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG3_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG4_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG5_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG6_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG7_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG8_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define DMA0_TRIG9_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define FC1_RTS_SCL_SSEL1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 1) /* PIO0_14 */
#define GPIO_PIO014_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT0_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT3_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT4_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT5_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT6_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define PINT_PINT7_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 0) /* PIO0_14 */
#define SCT0_IN0_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN2_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN3_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN4_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN5_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define SCT0_IN6_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 4) /* PIO0_14 */
#define UTICK0_CAPTURE1_PIO0_14 IOCON_MUX(14, IOCON_TYPE_D, 2) /* PIO0_14 */
#define ADC0_CH3_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define ADC0_TRIG1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define ADC0_TRIG2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define CTIMER4_CAPTURE0_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 3) /* PIO0_15 */
#define DMA0_TRIG0_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG10_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG11_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG12_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG13_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG14_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG15_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG16_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG17_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG18_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG19_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG20_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG21_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG22_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG23_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG24_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG25_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG26_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG27_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG28_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG29_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG3_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG4_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG5_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG6_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG7_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG8_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define DMA0_TRIG9_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define EMC_WEN_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 6) /* PIO0_15 */
#define FC6_CTS_SDA_SSEL0_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 1) /* PIO0_15 */
#define GPIO_PIO015_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT0_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT1_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT3_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT4_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT5_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT6_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define PINT_PINT7_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 0) /* PIO0_15 */
#define SCT0_OUT2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 4) /* PIO0_15 */
#define UTICK0_CAPTURE2_PIO0_15 IOCON_MUX(15, IOCON_TYPE_D, 2) /* PIO0_15 */
#define ADC0_CH4_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define ADC0_TRIG1_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define ADC0_TRIG2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define CLKOUT_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 2) /* PIO0_16 */
#define CTIMER1_CAPTURE0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 3) /* PIO0_16 */
#define DMA0_TRIG0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG10_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG11_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG12_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG13_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG14_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG15_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG16_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG17_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG18_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG19_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG1_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG20_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG21_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG22_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG23_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG24_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG25_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG26_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG27_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG28_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG29_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG3_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG4_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG5_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG6_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG7_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG8_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define DMA0_TRIG9_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define EMC_EMC_CS0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 6) /* PIO0_16 */
#define FC4_TXD_SCL_MISO_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 1) /* PIO0_16 */
#define GPIO_PIO016_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT0_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT1_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT2_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT3_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT4_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT5_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT6_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define PINT_PINT7_PIO0_16 IOCON_MUX(16, IOCON_TYPE_D, 0) /* PIO0_16 */
#define ADC0_TRIG1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define ADC0_TRIG2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG0_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG10_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG11_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG12_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG13_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG14_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG15_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG16_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG17_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG18_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG19_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG20_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG21_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG22_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG23_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG24_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG25_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG26_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG27_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG28_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG29_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG4_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG5_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG6_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG7_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG8_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define DMA0_TRIG9_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define EMC_OEN_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 6) /* PIO0_17 */
#define FC4_SSEL2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 1) /* PIO0_17 */
#define GPIO_PIO017_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT0_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT4_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT5_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT6_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define PINT_PINT7_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 0) /* PIO0_17 */
#define SCT0_IN0_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN1_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN2_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN3_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN4_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN5_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_IN6_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 3) /* PIO0_17 */
#define SCT0_OUT0_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 4) /* PIO0_17 */
#define SD_CARD_DET_N_PIO0_17 IOCON_MUX(17, IOCON_TYPE_D, 2) /* PIO0_17 */
#define ADC0_TRIG1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define ADC0_TRIG2_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define CTIMER1_MATCH0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 3) /* PIO0_18 */
#define DMA0_TRIG0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG10_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG11_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG12_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG13_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG14_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG15_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG16_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG17_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG18_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG19_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG20_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG21_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG22_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG23_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG24_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG25_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG26_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG27_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG28_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG29_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG2_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG3_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG4_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG5_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG6_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG7_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG8_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define DMA0_TRIG9_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define EMC_EMC_A0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 6) /* PIO0_18 */
#define FC4_CTS_SDA_SSEL0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 1) /* PIO0_18 */
#define GPIO_PIO018_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT0_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT2_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT3_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT4_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT5_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT6_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define PINT_PINT7_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 0) /* PIO0_18 */
#define SCI1_SCLK_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 5) /* PIO0_18 */
#define SCT0_OUT1_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 4) /* PIO0_18 */
#define SD_WR_PRT_PIO0_18 IOCON_MUX(18, IOCON_TYPE_D, 2) /* PIO0_18 */
#define ADC0_TRIG1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define ADC0_TRIG2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define CTIMER0_MATCH2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 3) /* PIO0_19 */
#define DMA0_TRIG0_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG10_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG11_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG12_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG13_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG14_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG15_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG16_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG17_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG18_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG19_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG20_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG21_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG22_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG23_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG24_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG25_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG26_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG27_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG28_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG29_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG3_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG4_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG5_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG6_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG7_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG8_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define DMA0_TRIG9_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define EMC_EMC_A1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 6) /* PIO0_19 */
#define FC4_RTS_SCL_SSEL1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 1) /* PIO0_19 */
#define FC7_TXD_SCL_MISO_WS_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 7) /* PIO0_19 */
#define GPIO_PIO019_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT0_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT1_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT3_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT4_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT5_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT6_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define PINT_PINT7_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 0) /* PIO0_19 */
#define SCT0_OUT2_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 4) /* PIO0_19 */
#define UTICK0_CAPTURE0_PIO0_19 IOCON_MUX(19, IOCON_TYPE_D, 2) /* PIO0_19 */
#define ADC0_TRIG1_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define ADC0_TRIG2_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define CTIMER1_MATCH1_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 2) /* PIO0_20 */
#define CTIMER3_CAPTURE3_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 3) /* PIO0_20 */
#define DMA0_TRIG0_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG10_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG11_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG12_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG13_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG14_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG15_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG16_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG17_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG18_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG19_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG1_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG20_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG21_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG22_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG23_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
#define DMA0_TRIG24_PIO0_20 IOCON_MUX(20, IOCON_TYPE_D, 0) /* PIO0_20 */
